xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
/***********************************************************************************************************************
 * File Name    : hal_entry.c
 * Description  : Main application
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2024 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
#include "hal_data.h"
#include "rtt_common_utils.h"
#include "application_utils.h"
#include "hdmi_cec_utils.h"
#include "hdmi_ddc_utils.h"

///####################### Application Option Setting #######################

#define APP_HDMI_DDC_PHYSICAL_ADDR_GET   (0) // 0: Use fixed value, 1: Get from sink device edid
#define APP_VENDOR_ID_INSTALL            (0) // 0: Use fixed value, 1: Install using SEGGER RTT Viewer

#define DEBUG_CEC_INTERRUPT_EVENT_OUTPUT (0) // 0: Disabled, 1: Enabled

///#################### End of Application Option Setting ###################

///########################### User Device Setting ##########################

/* My physical address. */
/* Specify your physical address. You can guess from the HDMI connector name you connected this device to.  */
/* If APP_HDMI_DDC_PHYSICAL_ADDR_GET is enabled (1), the value will be updated by information of EDID that acquired via HDMI-DDC (I2C). */
uint8_t my_physical_address[4] =                {0x0, 0x0, 0x0, 0x0}; // 0.0.0.0 for tv

/* My OSD name. */
/* The text will be displayed on TV menu. Maximum length is 14 bytes. */
#define MY_OSD_NAME_LENGTH                      (12)
const uint8_t my_osd_name[MY_OSD_NAME_LENGTH] = "RA CEC DEMO";

/* My Vendor ID. */
/* Specify vendor ID of your connected TV. For example, LG TV: {0x00, 0xE0, 0x91}. Toshiba TV: {0x00, 0x00, 0x39} */
/* If APP_VENDOR_ID_INSTALL is enabled (1), the value will be updated by SEGGER RTT Viewer installation. */
uint8_t my_vendor_id[3] =                       {0x00, 0x00, 0x39};

///####################### End of User Device Setting #######################

#if (DEBUG_CEC_INTERRUPT_EVENT_OUTPUT == 1)
#define RTT_DEBUG(fn_, ...)   APP_PRINT((fn_), ##__VA_ARGS__)
#else
#define RTT_DEBUG(...)
#endif

cec_addr_t my_logical_address = CEC_ADDR_UNREGISTERED;

volatile bool system_audio_mode_support_function = false;
volatile bool system_audio_mode_status = false;

/* List of CEC bus device status */
cec_device_status_t cec_bus_device_list[16];

/* User action request, type and target cec device */
volatile bool user_action_detect_flag = false;
uint8_t       user_action_type        = 0x0;
cec_addr_t    user_action_cec_target;

/* CEC action request and type */
volatile bool cec_action_request_detect_flag = false;
uint8_t       cec_action_type                = 0x0;

/* CEC interrupt event notification flags */
volatile bool        cec_rx_complete_flag = false;
volatile bool        cec_tx_complete_flag = false;
volatile bool        cec_err_flag = false;
volatile cec_error_t cec_err_type;

/* for i2c read */
uint32_t             cec_opecode_reg;
uint32_t             cec_opecode_param1_reg;
uint32_t             cec_opecode_param2_reg;
/* RX buffer for CEC reception data */
struct cec_event cec_ev_package[30] = {0};

/* i2c slave buffer */

#define I2C_SLAVE_TRANS_LEN 20
uint8_t g_i2c_slave_buffer[I2C_SLAVE_TRANS_LEN];
uint8_t g_slave_transfer_length = I2C_SLAVE_TRANS_LEN;
uint8_t i2c_reg_index = 0;
#define CEC_RX_DATA_BUFF_DATA_NUMBER (16 * 5)
cec_rx_message_buff_t cec_rx_data_buff[CEC_RX_DATA_BUFF_DATA_NUMBER];
volatile uint8_t      cec_rx_data_buff_next_store_point = 0;

i2c_slave_event_t g_i2c_slave_callback_event;
fsp_err_t cec_message_send(cec_addr_t destination, uint8_t opcode, uint8_t const * data_buff, uint8_t data_buff_length);

fsp_err_t cec_logical_address_allocate(void);
fsp_err_t cec_logical_address_allocate_attempt(cec_addr_t local_addr);

void cec_system_audio_mode_support_enabling(void);
void cec_system_audio_mode_request(void);

void cec_rx_data_check(void);
void cec_system_auto_response(cec_rx_message_buff_t const * buff);

void cec_bus_scan(void);
void cec_bus_status_buffer_display(void);

void R_BSP_WarmStart(bsp_warm_start_event_t event);

struct cmd_date
{
    uint8_t ladd;
    uint8_t param[15];
    uint8_t param_len;
};

uint8_t wr_cmd_opcde[20] =
{
    CEC_OPCODE_IMAGE_VIEW_ON,//0
    CEC_OPCODE_TEXT_VIEW_ON, //1
    CEC_OPCODE_ACTIVE_SOURCE, //2
};

struct cmd_date wr_cmd_date;
struct cmd_date rd_cmd_date;

/* [REG_INDEX] [CEC_ADDR {PHYSICAL ADDR} {LOGICAL ADDR}] [DATA] */
void cec_cmd_write(uint8_t wr_cmd_id, uint8_t *data)
{
    memcpy(&wr_cmd_date.param[0], data, wr_cmd_date.param_len);
    cec_message_send(wr_cmd_date.ladd,
        wr_cmd_opcde[wr_cmd_id], &wr_cmd_date.param[0], wr_cmd_date.param_len);
}

/* [REG_INDEX] [CEC_ADDR {PHYSICAL ADDR} {LOGICAL ADDR}] [DATA] */
void cec_cmd_read(uint8_t wr_cmd_id, uint8_t *data_buf)
{
    memcpy(data_buf, &cec_ev_package[wr_cmd_id],
        cec_ev_package[wr_cmd_id].param_sz + 1);
}

