xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
void i2c_slave_callback (i2c_slave_callback_args_t * p_args)
{
    fsp_err_t fsp_err = FSP_SUCCESS;

    g_i2c_slave_callback_event = p_args->event;

    /* slav_addr | reg_addr(ID) | data0 ~  data14 */

    if ((p_args->event == I2C_SLAVE_EVENT_RX_COMPLETE) ||
        (p_args->event == I2C_SLAVE_EVENT_TX_COMPLETE))
    {
        /* Transaction Successful */
        if (g_i2c_slave_callback_event == I2C_SLAVE_EVENT_RX_COMPLETE)
            i2c_reg_index = g_i2c_slave_buffer[0];
    }
    else if ((p_args->event == I2C_SLAVE_EVENT_RX_REQUEST) ||
             (p_args->event == I2C_SLAVE_EVENT_RX_MORE_REQUEST))
    {
        /* Read from Master */
        fsp_err = R_IIC_B_SLAVE_Read(&g_i2c_slave_ctrl,
            g_i2c_slave_buffer, g_slave_transfer_length);

        assert(FSP_SUCCESS == fsp_err);

        i2c_reg_index = g_i2c_slave_buffer[0];
        cec_cmd_write(i2c_reg_index, &g_i2c_slave_buffer[1]);
    }
    else if ((p_args->event == I2C_SLAVE_EVENT_TX_REQUEST) ||
            (p_args->event == I2C_SLAVE_EVENT_TX_MORE_REQUEST))
    {
        /* Write to master */

        cec_cmd_read(i2c_reg_index, &g_i2c_slave_buffer[1]);

        fsp_err = R_IIC_B_SLAVE_Write(&g_i2c_slave_ctrl,
            &g_i2c_slave_buffer[i2c_reg_index], g_slave_transfer_length);

        assert(FSP_SUCCESS == fsp_err);
    }
    else
    {
        /* Error Event - reported through g_i2c_slave_callback_event */
    }
}

void hal_entry(void)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    uint8_t cec_data[CEC_DATA_BUFFER_LENGTH];

    /* Print project banner */
    fsp_pack_version_t fsp_version = {RESET_VALUE};
    R_FSP_VersionGet(&fsp_version);
    APP_PRINT(BANNER_INFO, fsp_version.version_id_b.major,
                fsp_version.version_id_b.minor, fsp_version.version_id_b.patch);
    APP_PRINT(APP_DESCRIPTION);
    APP_PRINT(APP_LED_DESCRIPTION);

    /* Make 500 ms delay for HDMI connection. In deal,
     * the MCU should check the hot plug pin of HDMI connector.
     */
    R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);

    /* Initialize and enable external irq for user button detect */
    user_button_irq_initialize();

    /* Initialize LEDs. A pin for LED2 now starts PWM output. */
    demo_system_initialize();

    cec_opecode_reg = 0;
    /* Get physical address */
#if (APP_HDMI_DDC_PHYSICAL_ADDR_GET == 0)
    APP_PRINT("Fixed physical address will be used\r\n");
#else
    APP_PRINT("Getting physical address from EDID via HDMI-DDC channel (I2C) ...\r\n");
    fsp_err = physical_address_get(&my_physical_address[0]);
    if (FSP_SUCCESS != fsp_err) {
        APP_PRINT("DDC physical address get failed.\r\n");
        ERROR_INDICATE_LED_ON; __BKPT(0);
    }
#endif
    APP_PRINT("My physical address is %x.%x.%x.%x.\r\n\r\n",
                my_physical_address[3],
                my_physical_address[2],
                my_physical_address[1], my_physical_address[0]);

    /* Set my vendor ID */
#if (APP_VENDOR_ID_INSTALL == 0)
    APP_PRINT("Fixed vendor ID will be used.\r\n");
#else
    APP_PRINT("Setting up my vendor ID ...\r\n");
    vendor_id_install(&my_vendor_id[0]);
#endif
    APP_PRINT("My vendor ID is 0x%02x, 0x%02x, 0x%02x.\r\n\r\n",
            my_vendor_id[0], my_vendor_id[1], my_vendor_id[2]);

    /* i2c slave init */
    fsp_err = R_IIC_B_SLAVE_Open(&g_i2c_slave_ctrl, &g_i2c_slave_cfg);
    if (FSP_SUCCESS != fsp_err) { ERROR_INDICATE_LED_ON; __BKPT(0); }

    /* Open CEC module */
    fsp_err = R_CEC_Open(&g_cec0_ctrl, &g_cec0_cfg);
    if (FSP_SUCCESS != fsp_err) { ERROR_INDICATE_LED_ON; __BKPT(0); }

    /* Make 50 milliseconds delay. R_CEC_MediaInit may return
     * FSP_ERR_IN_USE for up to 45 milliseconds after
     * calling R_CEC_Open
     */
    R_BSP_SoftwareDelay(50, BSP_DELAY_UNITS_MILLISECONDS);

    /* Initialize CEC logical address */
    fsp_err = cec_logical_address_allocate();
    if (FSP_SUCCESS != fsp_err) {
        APP_PRINT("CEC logical address allocation failed.\r\n");
        ERROR_INDICATE_LED_ON; __BKPT(0);
    }

    APP_PRINT("CEC logical address allocation completed.\r\n");

    /* Now we recognize my logical address,
     * update internal cec bus device status buffer with my device info
     */
    cec_bus_device_list[my_logical_address].is_power_status_store = true;
    cec_bus_device_list[my_logical_address].power_status = 0x1;

    cec_bus_device_list[my_logical_address].is_version_store = true;
    cec_bus_device_list[my_logical_address].cec_version = CEC_VERSION_1_4;

    cec_bus_device_list[my_logical_address].is_physical_address_store = true;
    memcpy(&cec_bus_device_list[my_logical_address].physical_address[0], &my_physical_address[0], 4);

    cec_bus_device_list[my_logical_address].is_vendor_id_store = true;
    memcpy(&cec_bus_device_list[my_logical_address].vendor_id[0], &my_vendor_id[0], 3);

    /* Clear all internal flags */
    user_action_detect_flag = false;
    cec_rx_complete_flag = false;

    APP_PRINT(APP_COMMAND_OPTION,
              system_audio_mode_support_function ? SYS_AUDIO_FUNC_E : SYS_AUDIO_FUNC_D,
              system_audio_mode_status ? SYS_AUDIO_ON : SYS_AUDIO_OFF);

    while (1) {
        user_action_check();
        if (user_action_detect_flag) {
            user_action_detect_flag = false;
            user_action_process(cec_data);
        }

        cec_rx_data_check();
        if (cec_action_request_detect_flag) {
            cec_rx_data_process(cec_action_type);
        }

        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }
}

void cec_interrupt_callback(cec_callback_args_t *p_args)
{
    switch (p_args->event) {
        case CEC_EVENT_READY:
        {
            /* In this demo, the ready flag is received by R_CEC_StatusGet(). But application can also get with this interrupt event. */
            RTT_DEBUG("@@@ READY\r\n");
            break;
        }

        case CEC_EVENT_TX_COMPLETE:
        {
            /* Application processing after transmission has completed. */
            RTT_DEBUG("@@@ TX COMP\r\n");
            cec_tx_complete_flag = true;
            break;
        }

        case CEC_EVENT_RX_DATA:
        {
            RTT_DEBUG("@@@ RX 0x%x\r\n", p_args->data_byte);
            /* Application to store and process received data bytes. */
            cec_rx_message_buff_t* p_buff = &cec_rx_data_buff[cec_rx_data_buff_next_store_point];
            if (p_buff->byte_counter == 0) {
                p_buff->source = (uint8_t)(p_args->data_byte >> 4);
                p_buff->destination = (uint8_t)(p_args->data_byte & 0xF);
            } else if(p_buff->byte_counter == 1) {
                p_buff->opcode = p_args->data_byte;
            } else {
                p_buff->data_buff[p_buff->byte_counter - 2] = p_args->data_byte;
            }

            p_buff->byte_counter++;
            if(p_buff->byte_counter == CEC_DATA_BUFFER_LENGTH) {
                p_buff->byte_counter = 0;
            }
            break;
        }

        case CEC_EVENT_RX_COMPLETE:
        {
            /* Application processing for message reception complete. */
            RTT_DEBUG("@@@ RX COMP\r\n");

            cec_rx_data_buff[cec_rx_data_buff_next_store_point].is_new_data = true;

            cec_rx_data_buff_next_store_point++;
            if (cec_rx_data_buff_next_store_point >= CEC_RX_DATA_BUFF_DATA_NUMBER) {
                cec_rx_data_buff_next_store_point = 0;
            }
            break;
        }

