xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
        case CEC_EVENT_ERR:
        {
            cec_err_flag = true;
            cec_err_type = p_args->errors;

            if (cec_err_type & (CEC_ERROR_OERR | CEC_ERROR_TERR)) {
                cec_rx_message_buff_t* p_buff = &cec_rx_data_buff[cec_rx_data_buff_next_store_point];
                if (p_buff->byte_counter > 0) {
                    p_buff->is_error = true;

                    /* Cancel on-going store buffer */
                    p_buff->is_new_data = true;
                    cec_rx_data_buff_next_store_point++;
                    if (cec_rx_data_buff_next_store_point >=
                        CEC_RX_DATA_BUFF_DATA_NUMBER) {
                        cec_rx_data_buff_next_store_point = 0;
                    }
                }
            }

            RTT_DEBUG("@@@ ERR 0x%x\r\n", cec_err_type);
            break;
        }
        default: {
            /* Do nothing */
            break;
        }
    }
}

fsp_err_t cec_message_send(cec_addr_t destination,  uint8_t opcode,
                                                    uint8_t const *data_buff,
                                                    uint8_t data_buff_length)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    cec_message_t cec_tx_message;
    /* Total message size, including header, opcode, and data */
    uint8_t       cec_tx_message_length;
    uint8_t       err_detect = false;
    uint32_t      timeout_ms = (uint32_t)(5 + 40 * (2 + data_buff_length));
    uint32_t      opcode_list_point;

    APP_PRINT("[> CEC Out] Dest: %d (%s),\r\n", destination,
        &cec_logical_device_list[destination][0]);

    opcode_list_point = opcode_description_find(opcode);
    APP_PRINT("Opcode: 0x%x (%s)",
        opcode, &cec_opcode_list[opcode_list_point].opcode_desc_str[0]);
    if (data_buff_length > 0) {
        APP_PRINT(", Data: ");
        for (int j = 0; j < data_buff_length; j++) {
            APP_PRINT("0x%x,", data_buff[j]);
        }
    }
    APP_PRINT(" sending ... ");

    /* Clear CEC TX message buffer */
    memset(&cec_tx_message, 0U, sizeof(cec_tx_message));

    /* Create message */
    cec_tx_message.destination = destination;
    cec_tx_message.opcode      = opcode;
    memcpy(&cec_tx_message.data[0], data_buff, data_buff_length);
    cec_tx_message_length      = 2U + data_buff_length;

    /* Clear error flag */
    cec_err_flag = false;
    cec_err_type = 0x0;

    do {
        fsp_err = R_CEC_Write(&g_cec0_ctrl, &cec_tx_message, cec_tx_message_length);
    } while(FSP_ERR_IN_USE == fsp_err);

    if (FSP_SUCCESS != fsp_err) {
        APP_PRINT("R_CEC_Write failed.\r\n");
        ERROR_INDICATE_LED_ON; __BKPT(0);
    }

    /* Wait for tx completion */
    while(!cec_tx_complete_flag) {
        if (cec_err_flag) {
            cec_err_flag = false;

            if (cec_err_type & ( CEC_ERROR_UERR | CEC_ERROR_ACKERR |
                                CEC_ERROR_TXERR | CEC_ERROR_AERR |
                                CEC_ERROR_BLERR)) {
                err_detect = true;
                break;
            }
        }

        timeout_ms--;
        if(timeout_ms == 0) {
            break;
        }
        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    }
    cec_tx_complete_flag = false;

    if (0 < timeout_ms) {
        if (!err_detect) {
            APP_PRINT("Success\r\n");
            return FSP_SUCCESS;
        } else {
            APP_PRINT("Error (0x%x)\r\n", cec_err_type);
            return FSP_ERR_ASSERTION;
        }
    } else {
        APP_PRINT("Timeout\r\n", cec_err_type);
        return FSP_ERR_TIMEOUT;
    }
}

fsp_err_t cec_logical_address_allocate(void)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    bool logical_address_allocate = false;
    uint8_t rtt_read_data_c = '1';

    /* APP_PRINT(CEC_LOGICAL_DEVICE_SELECT_MENU); */
    APP_PRINT("CEC Role : TV\r\n");

    if (('1' < rtt_read_data_c) || (rtt_read_data_c > '5')) {
        goto RESULT_LOGICAL_ADDRESS;
    }

    switch(rtt_read_data_c) {
        case '1':
        {
            fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_TV);
            if (fsp_err == FSP_SUCCESS) {
                logical_address_allocate = true;
                my_logical_address = CEC_ADDR_TV;
            }
            break;
        }

        case '2':
        {
            fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_RECORDING_DEVICE_1);

            if(fsp_err == FSP_SUCCESS) {
                logical_address_allocate = true;
                my_logical_address = CEC_ADDR_RECORDING_DEVICE_1;
            }

            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_RECORDING_DEVICE_2);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_RECORDING_DEVICE_2;
                }
            }

            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_RECORDING_DEVICE_3);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_RECORDING_DEVICE_3;
                }
            }
            break;
        }

        case '3':
        {
            fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_TUNER_1);
            if (fsp_err == FSP_SUCCESS) {
                logical_address_allocate = true;
                my_logical_address = CEC_ADDR_TUNER_1;
            }

            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_TUNER_2);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_TUNER_2;
                }
            }

