xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_TUNER_3);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_TUNER_3;
                }
            }

            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_TUNER_4);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_TUNER_4;
                }
            }
            break;
        }

        case '4':
        {
            fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_PLAYBACK_DEVICE_1);
            if (fsp_err == FSP_SUCCESS) {
                logical_address_allocate = true;
                my_logical_address = CEC_ADDR_PLAYBACK_DEVICE_1;
            }

            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_PLAYBACK_DEVICE_2);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_PLAYBACK_DEVICE_2;
                }
            }

            if (logical_address_allocate == false) {
                fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_PLAYBACK_DEVICE_3);
                if (fsp_err == FSP_SUCCESS) {
                    logical_address_allocate = true;
                    my_logical_address = CEC_ADDR_PLAYBACK_DEVICE_3;
                }
            }
            break;
        }

        case '5':
        {
            fsp_err = cec_logical_address_allocate_attempt(CEC_ADDR_AUDIO_SYSTEM);
            if (fsp_err == FSP_SUCCESS) {
                logical_address_allocate = true;
                my_logical_address = CEC_ADDR_AUDIO_SYSTEM;
            }
            break;
        }

        default:
        {
            break;
        }
    }

RESULT_LOGICAL_ADDRESS:
    if (logical_address_allocate) {
        cec_bus_device_list[my_logical_address].is_device_active = true;
        cec_bus_device_list[my_logical_address].is_my_device = true;
        APP_PRINT("Logical address %s has been allocated.\r\n", cec_logical_device_list[my_logical_address]);
        return FSP_SUCCESS;
    } else {
        APP_PRINT("The Selected logical address type is in use by"
            "another device. Enter another one.\r\n");
        return FSP_ERR_IN_USE;
    }
}

fsp_err_t cec_logical_address_allocate_attempt(cec_addr_t logical_addr)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    cec_status_t cec_status;
    uint32_t timeout_ms = 100;

    do {
        fsp_err = R_CEC_MediaInit(&g_cec0_ctrl, logical_addr);
    } while(FSP_ERR_IN_USE == fsp_err);
    if (FSP_SUCCESS != fsp_err) {ERROR_INDICATE_LED_ON; __BKPT(0);}

    /* Wait for local address allocation and CEC bus to be free */
    do {
        fsp_err = R_CEC_StatusGet(&g_cec0_ctrl, &cec_status);
        timeout_ms--;
        if (!timeout_ms) {
            break;
        }
        R_BSP_SoftwareDelay(1, BSP_DELAY_UNITS_MILLISECONDS);
    } while((FSP_SUCCESS == fsp_err) && (CEC_STATE_READY != cec_status.state));

    if (CEC_STATE_READY != cec_status.state) {
        return FSP_ERR_IN_USE;
    }

    return FSP_SUCCESS;
}

void cec_system_audio_mode_support_enabling(void)
{
    system_audio_mode_support_function = !system_audio_mode_support_function;

    if (system_audio_mode_support_function) {
        APP_PRINT("System Audio mode function support enabled.\r\n");
    } else {
        if (system_audio_mode_status) {
            uint8_t    cec_data[CEC_DATA_BUFFER_LENGTH];

            cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
            cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);

            APP_PRINT("System Audio mode is disabled.\r\n");
        }

        APP_PRINT("System Audio mode function support disabled.\r\n");
    }
}

void cec_system_audio_mode_request(void)
{
    fsp_err_t fsp_err = FSP_SUCCESS;
    bool       active_source_find = false;
    uint8_t    cec_data[CEC_DATA_BUFFER_LENGTH];

    /* Enable System Audio mode support */
    system_audio_mode_support_function = true;

    if (system_audio_mode_status == false) {
        /* The Active source must be checked to request System Audio mode */
        for (int i=0; i<12; i++) {
            if (cec_bus_device_list[i].is_active_source) {
                APP_PRINT("Current active source is %s.\r\n", &cec_logical_device_list[i]);
                active_source_find = true;
                break;
            }
        }

        if (active_source_find) {
            /* Disable System Audio mode once */
            cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
            cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);

            R_BSP_SoftwareDelay(300, BSP_DELAY_UNITS_MILLISECONDS);

            APP_PRINT("Sending System Audio On request ...\r\n");

            cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_ON;
            fsp_err = cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);
            if (FSP_SUCCESS == fsp_err) {
                APP_PRINT("System Audio mode is disabled.\r\n");
                system_audio_mode_status = true;
            } else {
                APP_PRINT("System Audio mode request failed.\r\n");
                system_audio_mode_status = false;
            }
        } else {
            APP_PRINT("Active source is not found. Try bus scan to get.\r\n");
        }
    } else {
        cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
        cec_message_send(CEC_ADDR_TV, CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);

        APP_PRINT("System Audio mode is disabled.\r\n");

        system_audio_mode_status = false;
    }

