xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
            /*
            cec_message_send(p_rx_data->source,
                CEC_OPCODE_DECK_STATUS, [Deck Info], [Deck Info] LEN);
            */
            break;
        }

        /* Device Menu Control Feature */
        case CEC_OPCODE_MENU_REQUEST:
        {
            /*
             * 1. Local device may activate or deactivate the device menu.
             * 2. Reply the CEC COMMAND {Inform Menu Status} to TV.
             */

//            cec_ev_package[EV_MENU_REQUEST].ev_id = EV_MENU_REQUEST;
//            cec_ev_package[EV_MENU_REQUEST].laddr = p_buff->source;
//            cec_ev_package[EV_MENU_REQUEST].param[0] = p_buff->data_buff[0]);
//            cec_ev_package[EV_MENU_REQUEST].param_sz = 1;

            /*
            cec_message_send(p_rx_data->source,
                CEC_OPCODE_MENU_STATUS, [Menu State], [Menu State] LEN);
            */
            break;
        }

        /* Timer Programming Feature */
        case CEC_OPCODE_CLEAR_DIGITAL_TIMER:
        {
            /* 1. Reply with the CEC COMMAND {Report Timer Cleared Status} */
//            cec_ev_package[EV_CLEAR_DIGITAL_TIMER].ev_id = EV_CLEAR_DIGITAL_TIMER;
//            cec_ev_package[EV_CLEAR_DIGITAL_TIMER].laddr = p_buff->source;
//            memcpy(&cec_ev_package[EV_CLEAR_DIGITAL_TIMER].param[0], &p_buff->data_buff[0], 15);
//            cec_ev_package[EV_CLEAR_DIGITAL_TIMER].param_sz = 15;

            /*
            cec_message_send(p_rx_data->source,
                CEC_OPCODE_TIMER_STATUS, [Timer Status Data], [Timer Status Data] LEN);
            */
            break;
        }

        case CEC_OPCODE_SET_DIGITAL_TIMER:
        {
           /*
            * 1. Reply with the CEC COMMAND {Report Timer Status}
            * 2. Save the program title if receives an optional EVENT
            *    <Requested Set Timer Program Title>
            */
//            cec_ev_package[EV_SET_DIGITAL_TIMER].ev_id = EV_SET_DIGITAL_TIMER;
//            cec_ev_package[EV_SET_DIGITAL_TIMER].laddr = p_buff->source;
//            memcpy(&cec_ev_package[EV_SET_DIGITAL_TIMER].param[0], &p_buff->data_buff[0], 15);
//            cec_ev_package[EV_SET_DIGITAL_TIMER].param_sz = 15;
            /*
            cec_message_send(p_rx_data->source,
                CEC_OPCODE_TIMER_STATUS, [Timer Status Data], [Timer Status Data] LEN);
            */
            break;
        }

        /* One Touch Record feature */
        case CEC_OPCODE_RECORD_TV_SCREEN:
        {
//            cec_ev_package[EV_RECORD_TV_SCREEN].ev_id = EV_RECORD_TV_SCREEN;
//            cec_ev_package[EV_RECORD_TV_SCREEN].laddr = p_buff->source;
//            cec_ev_package[EV_RECORD_TV_SCREEN].param_sz = 0;
            /*
            cec_message_send(p_rx_data->source,
                CEC_OPCODE_RECORD_ON, [Record Source], [Record Source] LEN);
            */
            break;
        }

        /* Informed Menu Status */
        case CEC_OPCODE_GET_MENU_LANGUAGE:
        {
//            cec_ev_package[EV_GET_MENU_LANGUAGE].ev_id = EV_GET_MENU_LANGUAGE;
//            cec_ev_package[EV_GET_MENU_LANGUAGE].laddr = p_buff->source;
//            cec_ev_package[EV_SET_MENU_LANGUAGE].param_sz = 0;
//
//            cec_message_send(CEC_ADDR_BROADCAST,
//                CEC_OPCODE_SET_MENU_LANGUAGE, &cec_data[0], 3);
            break;
        }

        case CEC_OPCODE_GIVE_PHYSICAL_ADDRESS:
        {
            /* Give Physical Address (0x83) => Report Physical Address */
            if (cec_bus_device_list[my_logical_address].is_physical_address_store) {
                cec_data[0] =
                    (cec_bus_device_list[my_logical_address].physical_address[3] << 4) |
                     cec_bus_device_list[my_logical_address].physical_address[2];

                cec_data[1] =
                    (cec_bus_device_list[my_logical_address].physical_address[1] << 4) |
                     cec_bus_device_list[my_logical_address].physical_address[0];
            } else {
                cec_data[0] = (my_physical_address[3] << 4) |
                                my_physical_address[2];
                cec_data[1] = (my_physical_address[1] << 4) |
                                my_physical_address[0];
            }

            cec_device_type_t device_type =
                convert_logical_address_to_device_type(my_logical_address);

            if (device_type != CEC_DEVICE_TYPE_UNKNOWN) {
                cec_data[2] = device_type;
            }

            cec_message_send(CEC_ADDR_BROADCAST, CEC_OPCODE_REPORT_PHYSICAL_ADDRESS, &cec_data[0], 3);
            break;
        }

        case CEC_OPCODE_GIVE_DEVICE_VENDOR_ID:
        {
            /* Give Device Vendor ID (0x8C) => Device Vendor ID */
            if (cec_bus_device_list[my_logical_address].is_vendor_id_store) {
                cec_message_send(CEC_ADDR_BROADCAST, CEC_OPCODE_DEVICE_VENDOR_ID,
                                    &cec_bus_device_list[my_logical_address].vendor_id[0], 3);
            } else {
                cec_message_send(CEC_ADDR_BROADCAST, CEC_OPCODE_DEVICE_VENDOR_ID,
                                    &my_vendor_id[0], 3);
            }
            break;
        }

        case CEC_OPCODE_GIVE_OSD_NAME:
        {
            /* Give OSD Name (0x46) => Set OSD Name */
            cec_message_send(p_rx_data->source, CEC_OPCODE_SET_OSD_NAME,
                                &my_osd_name[0], MY_OSD_NAME_LENGTH);
            break;
        }

        case CEC_OPCODE_GIVE_POWER_STATUS:
        {
            /* Give Device Power Status (0x8F) => Report Power Status */
            if(cec_bus_device_list[my_logical_address].power_status == 0x1) {
                cec_data[0] = CEC_POWER_STATUS_ON;
            } else {
                cec_data[0] = CEC_POWER_STATUS_STANDBY;
            }
            cec_message_send(p_rx_data->source, CEC_OPCODE_REPORT_POWER_STATUS,
                                &cec_data[0], 1);
            break;
        }

        case CEC_OPCODE_GIVE_AUDIO_STATUS:
        {
            /* Give Audio Status (0x7A) => Report Audio Status */
            bool    mute;
            uint8_t volume;
            demo_system_volume_status_get(&mute, &volume);

            cec_data[0] = (uint8_t)((mute << 7) | (volume & 0x7F));
            cec_message_send(p_rx_data->source,
                    CEC_OPCODE_REPORT_AUDIO_STATUS, &cec_data[0], 1);
            break;
        }

        case CEC_OPCODE_SYSTEM_AUDIO_MODE_REQUEST:
        {
          /*
           * System Audio Mode Request (0x70) =>
           * If message has active source address,
           * accept system audio mode enabling.
           */
            if (system_audio_mode_support_function) {
                /*
                 * If data field is filled, this means System Audio Mode is
                 * requested to be turned On. Otherwise, requested to be off
                 */
                if (p_rx_data->byte_counter >= 3) {
                    cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_ON;
                } else {
                    cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
                }

                fsp_err = cec_message_send(CEC_ADDR_TV,
                    CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);
                if (FSP_SUCCESS == fsp_err) {
                    if (cec_data[0] == CEC_SYSTEM_AUDIO_STATUS_ON) {
                        APP_PRINT("System Audio mode is enabled by TV.\r\n");
                        system_audio_mode_status = true;
                    } else {
                        APP_PRINT("System Audio mode is disabled by TV.\r\n");
                        system_audio_mode_status = false;
                    }
                }
            } else {
                APP_PRINT("Received System Audio mode request."
                        "But function is not enabled, so reject it.\r\n");
                system_audio_mode_status = false;

                cec_data[0] = CEC_SYSTEM_AUDIO_STATUS_OFF;
                cec_message_send(CEC_ADDR_TV,
                    CEC_OPCODE_SET_SYSTEM_AUDIO_MODE, &cec_data[0], 1);
            }
            break;
        }

        case CEC_OPCODE_GIVE_SYSTEM_AUDIO_MODE_STATUS:
        {
           /*
            * Give System Audio Mode Status (0x7D) =>
            * System Audio Mode Status (0x7E)
            */
            if (system_audio_mode_status) {
                cec_data[0] = 0x1;
            } else {
                cec_data[0] = 0x0;
            }

