xlloss/RA4E2_HDMI_CEC_RX/src/hal_entry.c
            cec_message_send(p_rx_data->source,
                CEC_OPCODE_SYSTEM_AUDIO_MODE_STATUS, &cec_data[0], 1);
            break;
        }

        case CEC_OPCODE_SYSTEM_AUDIO_MODE_STATUS:
        {
            /* System Audio Mode Status (0x7E) => (Internal data update) */
            if (p_rx_data->byte_counter >= 3) {
                if (p_rx_data->data_buff[0] == 0x1) {
                    APP_PRINT("System Audio mode is enabled.\r\n");
                    system_audio_mode_status = true;
                } else {
                    APP_PRINT("System Audio mode is disabled.\r\n");
                    system_audio_mode_status = false;
                }
            }
            break;
        }

        case CEC_OPCODE_REPORT_PHYSICAL_ADDRESS:
        {
            /* Report Physical Address (0x84) => (Internal buffer update) */
            if (p_rx_data->source != CEC_ADDR_UNREGISTERED) {
                /* Raise device active flag */
                cec_bus_device_list[p_rx_data->source].is_device_active = true;

                /* Store to internal buffer */
                cec_bus_device_list[p_rx_data->source].is_physical_address_store = true;

                cec_bus_device_list[p_rx_data->source].physical_address[3] =
                    (p_rx_data->data_buff[0] >> 4);

                cec_bus_device_list[p_rx_data->source].physical_address[2] =
                    (p_rx_data->data_buff[0] & 0x0F);

                cec_bus_device_list[p_rx_data->source].physical_address[1] =
                    (p_rx_data->data_buff[1] >> 4);

                cec_bus_device_list[p_rx_data->source].physical_address[0] =
                    (p_rx_data->data_buff[1] & 0x0F);
            }
            break;
        }

        case CEC_OPCODE_GET_CEC_VERSION:
        {
            /* CEC Version (0x9E) => (Internal buffer update) */
            if (p_rx_data->source != CEC_ADDR_UNREGISTERED) {
                /* Raise device active flag */
                cec_bus_device_list[p_rx_data->source].is_device_active = true;

                /* Store to internal buffer */
                cec_bus_device_list[p_rx_data->source].is_version_store = true;
                cec_bus_device_list[p_rx_data->source].cec_version = p_rx_data->data_buff[0];
            }
            cec_data[0] = cec_bus_device_list[my_logical_address].cec_version;
            cec_message_send(p_rx_data->source, CEC_OPCODE_CEC_VERSION, &cec_data[0], 1);
            break;
        }

        case CEC_OPCODE_REPORT_POWER_STATUS:
        {
            /* Report Power Status (0x90) => (Internal buffer update) */
            if (p_rx_data->source != CEC_ADDR_UNREGISTERED) {
                /* Raise device active flag */
                cec_bus_device_list[p_rx_data->source].is_device_active = true;

                /* Store to internal buffer */
                cec_bus_device_list[p_rx_data->source].is_power_status_store = true;
                if ((p_rx_data->data_buff[0] == CEC_POWER_STATUS_ON) ||
                    (p_rx_data->data_buff[0] == CEC_POWER_STATUS_IN_TRANSITION_TO_ON)) {
                    cec_bus_device_list[p_rx_data->source].power_status = 0x1;
                } else if ((p_rx_data->data_buff[0] == CEC_POWER_STATUS_STANDBY) ||
                           (p_rx_data->data_buff[0] == CEC_POWER_STATUS_IN_TRANSITION_TO_STANDBY)) {
                    cec_bus_device_list[p_rx_data->source].power_status = 0x0;
                }
            }
            break;
        }

        case CEC_OPCODE_ACTIVE_SOURCE:
        {
            /* Active Source (0x82) => (Internal buffer update) */
            if (p_rx_data->source != CEC_ADDR_UNREGISTERED) {
                /* Raise device active flag */
                cec_bus_device_list[p_rx_data->source].is_device_active = true;

                /* Clear is_active_source flag for all devices once */
                for(int i = 0; i < 12; i++) {
                    cec_bus_device_list[i].is_active_source = false;
                }

                /* Set a flag for current active source device */
                cec_bus_device_list[p_rx_data->source].is_active_source = true;
            }
            break;
        }

        case CEC_OPCODE_DEVICE_VENDOR_ID:
        {
            /* Vendor ID (0x87) => (Internal buffer update) */
            if (p_rx_data->source != CEC_ADDR_UNREGISTERED) {
                /* Raise device active flag */
                cec_bus_device_list[p_rx_data->source].is_device_active = true;

                /* Store to internal buffer */
                cec_bus_device_list[p_rx_data->source].is_vendor_id_store = true;
                memcpy(&cec_bus_device_list[p_rx_data->source].vendor_id[0],
                        &p_rx_data->data_buff[0], 3);
            }
            break;
        }

        default:
        {
            /* Opcode that cannot be response => Feature Abort */
            if (p_rx_data->destination != CEC_ADDR_BROADCAST) {
                if (!((p_rx_data->opcode == CEC_OPCODE_FEATURE_ABORT) |
                    (p_rx_data->opcode == CEC_OPCODE_ABORT))) {
                    cec_data[0] = p_rx_data->opcode;
                    cec_data[1] = CEC_ABOUT_REASON_UNRECOFNIZED_OPCODE;
                    cec_message_send(p_rx_data->source,
                        CEC_OPCODE_FEATURE_ABORT, &cec_data[0], 2);
                }
            }
            break;
        }
    }
}

void cec_bus_scan(void)
{
    /* Request physical address to all devices sequentially */
    APP_PRINT("Requesting physical address ...\r\n");
    for( int i = 0; i < 12; i++) {
        if (i != my_logical_address) {
            cec_message_send(i, CEC_OPCODE_GIVE_PHYSICAL_ADDRESS, NULL, 0);
            R_BSP_SoftwareDelay(400, BSP_DELAY_UNITS_MILLISECONDS);
        }
    }

    /* Request vendor id to all devices sequentially */
    APP_PRINT("Requesting vendor id ...\r\n");
    for (int i = 0; i < 12; i++) {
        if (i != my_logical_address) {
            cec_message_send(i, CEC_OPCODE_GIVE_DEVICE_VENDOR_ID, NULL, 0);
            R_BSP_SoftwareDelay(400, BSP_DELAY_UNITS_MILLISECONDS);
        }
    }

    /* Request CEC version to all devices sequentially */
    APP_PRINT("Requesting CEC version ...\r\n");
    for (int i = 0; i < 12; i++) {
        if (i != my_logical_address) {
            cec_message_send(i, CEC_OPCODE_GET_CEC_VERSION, NULL, 0);
            R_BSP_SoftwareDelay(400, BSP_DELAY_UNITS_MILLISECONDS);
        }
    }

    /* Request Power status to all devices sequentially */
    APP_PRINT("Requesting power status ...\r\n");
    for (int i = 0; i < 12; i++) {
        if (i != my_logical_address) {
            cec_message_send(i, CEC_OPCODE_GIVE_POWER_STATUS, NULL, 0);
            R_BSP_SoftwareDelay(400, BSP_DELAY_UNITS_MILLISECONDS);
        }
    }

    /* Request Active Source to broadcast */
    APP_PRINT("Requesting active source ...\r\n");
    cec_message_send(CEC_ADDR_BROADCAST, CEC_OPCODE_REQUEST_ACTIVE_SOURCE, NULL, 0);
}

void cec_bus_status_buffer_display(void)
{
    for (int i = 0; i < 15; i++) {
        if (cec_bus_device_list[i].is_device_active) {
            cec_device_status_display(i, &cec_bus_device_list[i]);
        }
    }
}

void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_POST_C == event) {
        /* Configure pins. */
        R_IOPORT_Open (&g_ioport_ctrl, &IOPORT_CFG_NAME);
    }
}
